Revit 2024 API
SpecTypeId.SiteAngle Property
 Site Angle, in discipline Common.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId SiteAngle { get; }
Visual Basic
Public Shared ReadOnly Property SiteAngle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SiteAngle {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace